#დავალება1
fav_movies = ("Interstellar", "Inception", "The Dark Knight", "The Matrix", "Avatar")
for movie in fav_movies:
    print(movie, type(movie))
#დავალება2
#​მსგავსება: ორივე მათგანი გამოიყენება მონაცემთა კოლექციების (ელემენტების სიის) შესანახად, ორივეში ელემენტები ინახება თანმიმდევრულად და ორივეგან შეგვიძლია ელემენტებზე წვდომა ინდექსების (მაგ. [0]) საშუალებით.
#​განსხვავება: * List არის Mutable (ცვლადი) – შექმნის შემდეგ შეგვიძლია ელემენტების ჩამატება, წაშლა ან შეცვლა. იწერება კვადრატულ ფრჩხილებში [].
#​Tuple არის Immutable (უცვლელი) – შექმნის შემდეგ მასში არაფრის შეცვლა, წაშლა ან დამატება არ შეგვიძლია. იწერება მრგვალ ფრჩხილებში ().
#დავალება3
numbers = (1, 2, 3, 4, 5)
a, b, rest = numbers

print(a)     
print(b)     
print(rest)  

numbers = (1, 2, 3, 4, 5)
a, b, rest = numbers

print(a)     
print(b)     
print(rest)  


#დავალება4
my_tuple = ("ვაშლი", "მსხალი", "ატამი", "საზამთრო", "ნესვი", "ალუბალი", "მარწყვი")
item1, item2, item3, *other_items = my_tuple
print("ცვლადი 1:", item1)
print("ცვლადი 2:", item2)
print("ცვლადი 3:", item3)
print("ცვლადი 4 (დანარჩენი ელემენტები):", other_items)