#დავალება 1
# +  (მიმატება): კრებს ორ რიცხვს
print(10 + 5)  # დაპრინტავს: 15

# - (გამოკლება): აკლებს მეორე რიცხვს პირველს
print(10 - 5)  # დაპრინტავს: 5

# *(გამრავლება): ამრავლებს რიცხვებს ერთმანეთზე
print(10 * 5)  # დაპრინტავს: 50

# /  (გაყოფა): ყოფს რიცხვს და ყოველთვის აბრუნებს ათწილადს (float)
print(10 / 5)  # დაპრინტავს: 2.0

# // (მთელი გაყოფა): ყოფს რიცხვს და აბრუნებს მხოლოდ მთელ ნაწილს ნაშთის გარეშე
print(10 // 3)  # დაპრინტავს: 3

# %  (ნაშთიანი გაყოფა / მოდული): აბრუნებს გაყოფის შედეგად მიღებულ ნაშთს
print(10 % 3)  # დაპრინტავს: 1 (რადგან 3 * 3 არის 9, ნაშთი რჩება 1)

# ** (ხარისხში აყვანა): აჰყავს რიცხვი მოცემულ ხარისხში
print(2 ** 3)  # დაპრინტავს: 8 (2 * 2 * 2)

#დავალება 2
#კონკატენაცია არის ორი ან მეტი სტრინგის (ტექსტის) ერთმანეთზე გადაბმა-გაერთიანება
#"+" ოპერატორის გამოყენებით.
#მაგალითი 1
word1 = "Hello "
word2 = "World"
result1 = word1 + word2
print(result1)  # დაპრინტავს: Hello World

#მაგალითი 2
first_name = "გიორგი"
last_name = "ბერიძე"
result2 = "სტუდენტი: " + first_name + " " + last_name
print(result2)  # დაპრინტავს: სტუდენტი: გიორგი ბერიძე

#დავალება 3
num1 = 25
num2 = 40
print(num1)
print(num2)
#დავალება 4
name = "ნიკა"
age = 16
height = 1.75
print(f"Hello {name}, my age is {age} and my height is {height}")